app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @posts = Post.all

    respond_to do |format|
      if @post.save
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
INSERT INTO "posts" ("updated_at", "image_url", "created_at", "description") VALUES ('2011-02-10 01:45:14.397909', 'aoiuweuroiuq.jpg', '2011-02-10 01:45:14.397909', 'test tteisjkrthjishepoihrsphuj tisdkjhsdopkjwoeituoseif oihejrpjhads oiehrj[oi asjdf[oi eoirjf [aseroije voijertoiu qv[oi')

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 9) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 9)